; 1.22

; 素数チェック用

(define (divides? a b)
  (= (remainder b a) 0))

(define (find-divisor n test-divisor)
  (cond ((> (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (else (find-divisor n (+ test-divisor 1)))))

(define (smallest-divisor n)
  (find-divisor n 2))

(define (prime? n)
  (= n (smallest-divisor n)))


; 目的のプログラム

(define (timed-prime-test n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))

(define (start-prime-test n start-time)
  (if (prime? n)
      (report-prime (- (runtime) start-time))))

(define (report-prime elapsed-time)
  (display " *** ")
  (display elapsed-time))

(define (search-for-primes n max)
  (cond ((even? n) (search-for-primes (+ n 1) max))
        ((> n max) "finish")
        (else
          (timed-prime-test n)
          (search-for-primes (+ n 2) max))))


; 時間計測の課題だが、測定の精度が十分でないらしく、100,000 と 1,000,000 での比較が行えなかった為、100,000,000 と 1,000,000,000 で比較した。

; 100,000,000 から 100,000,050 までに存在する素数
;
(search-for-primes 100000000 100000050)
; 100000001
; 100000003
; 100000005
; 100000007 *** .01999999999999999
; 100000009
; 100000011
; 100000013
; 100000015
; 100000017
; 100000019
; 100000021
; 100000023
; 100000025
; 100000027
; 100000029
; 100000031
; 100000033
; 100000035
; 100000037 *** 2.0000000000000018e-2
; 100000039 *** 9.999999999999981e-3
; 100000041
; 100000043
; 100000045
; 100000047
; 100000049 *** 1.0000000000000009e-2
;
; 計測時間の平均をとると、(0.01+0.01+0.02+0.02)/4 = 0.015 である。

; 1,000,000,000 から 1,000,000,050 までに存在する素数
;
(search-for-primes 1000000000 1000000050)
; 1000000001
; 1000000003
; 1000000005
; 1000000007 *** .04999999999999999
; 1000000009 *** .05000000000000002
; 1000000011
; 1000000013
; 1000000015
; 1000000017
; 1000000019
; 1000000021 *** .03999999999999998
; 1000000023
; 1000000025
; 1000000027
; 1000000029
; 1000000031
; 1000000033 *** .03999999999999998
; 1000000035
; 1000000037
; 1000000039
; 1000000041
; 1000000043
; 1000000045
; 1000000047
; 1000000049
;
; 計測時間の平均をとると、(0.04+0.04+0.05+0.05)/4 = 0.045 である。

; √10 ~ 3.16 であり、0.015 * 3.16 = 0.0474 なので、精度は悪いながらも、ここでは確かに計算に必要なステップ数に比例して計算時間が長くなっている。

